"-----------------------------------------
"my first vimrc
"2013.8.27
"............
"-----------------------------------------
autocmd! bufwritepost .vimrc source ~/../.vim/.vimrc

"----------------下面是第一耻--------------------------------------------
"set nu "不用废话
"
"set statusline=%2*%n%m%r%h%w%*\ %F\ %1*[FORMAT=%2*%{&ff}:%{&fenc!=''?&fenc:&enc}%1*]\ [TYPE=%2*%Y%1*]\ [COL=%2*%03v%1*]\ [ROW=%2*%03l%1*/%3*%L(%p%%)%1*]
"set ruler "设置下标行列号
"------------------------------------------------------------------------

"-------------参考ma6174的配置--------------------------------------------
"--------------------------------------------------------
"begin              关于显示的
"--------------------------------------------------------
set nu              "不用废话
set ruler           " 显示标尺  
set showcmd         " 输入的命令显示出来，看的清楚些  
"set whichwrap+=<,>,h,l   " 允许backspace和光标键跨越行边界(不建议)  
set scrolloff=3     " 光标移动到buffer的顶部和底部时保持3行距离  
set statusline=%F%r%h\ [FORMAT=%{&ff}]\ [POS=%l,%v]\ [%p%%]   "状态行显示的 
set laststatus=2    " 启动显示状态行(1),总是显示状态行(2)  
"set foldenable     " 允许折叠  未弄清作用  暂时关闭
"set foldmethod=manual   " 手动折叠  未弄清作用  暂时关闭
set nocompatible    "去掉讨厌的有关vi一致性模式，避免以前版本的一些bug和局限
syntax on	    "语法高亮
"DoMatchParen        "配对括号(不明白为什么不好用)
"set fileencodings=utf-8
"set encoding=utf-8
"set fenc=utf-8
"set fencs=utf-8,gbk
"--------------------------------------------------------
"end
"-------------------------------------------------------

"--------------------------------------------------------
"begin               控制的
"--------------------------------------------------------
"set mouse=a        "控制鼠标的，注释关闭，搞笑的是滚轮能用 
set nobackup        "不要备份
set noswapfile      "不要交换文件
set ignorecase      "搜索忽略大小写
set autoread        "文件自动载入
set autowrite       "自动保存
set numberwidth=4   "行号栏的宽度(你的单文件长会超过1万行？)
"set columns=135    "初始窗口的宽度
set lines=80        "初始窗口的高度
"winpos 620 45      "初始窗口的位置
"--------------------------------------------------------
"end
"-------------------------------------------------------

"--------------------------------------------------------
"begin               各种映射map
"--------------------------------------------------------
"插入环境下复制
imap <C-c> <Esc>"+ya
"可视环境下复制
vmap <C-c> "+y
"插入环境下粘贴(view 不准粘贴)
imap <C-v> <Esc>"+pa
"--------------------------------------------------------
"end
"-------------------------------------------------------

"-------------------------------------------------------
"begin             master插件 bundle(还是该叫vundle)
"------------------------------------------------------
filetype off      "没弄清
set rtp+=~/.vim/bundle/vundle/
call vundle#rc()
"github的格式
Bundle 'gmarik/vundle' 
Bundle 'The-NERD-tree'
filetype plugin indent on
"-----------------------------------------------------
"end
"------------------------------------------------------
"-------------------------------------------------------------------------
